In [1]:
import pandas as pd
import seaborn as sn
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df1=pd.read_csv('df_final_web_data_pt_1.txt')

In [3]:
df2=pd.read_csv('df_final_web_data_pt_2.txt')

In [4]:
df1

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04
...,...,...,...,...,...
343136,2443347,465784886_73090545671,136329900_10529659391_316129,confirm,2017-03-31 15:15:46
343137,2443347,465784886_73090545671,136329900_10529659391_316129,step_3,2017-03-31 15:14:53
343138,2443347,465784886_73090545671,136329900_10529659391_316129,step_2,2017-03-31 15:12:08
343139,2443347,465784886_73090545671,136329900_10529659391_316129,step_1,2017-03-31 15:11:37
343140,2443347,465784886_73090545671,136329900_10529659391_316129,start,2017-03-31 15:10:47

In [5]:
df2

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58
...,...,...,...,...,...
412259,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10
412260,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29
412261,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51
412262,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34
412263,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09

In [6]:
dataset=pd.concat([df1,df2],axis=0)

In [7]:
dataset

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04
...,...,...,...,...,...
412259,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10
412260,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29
412261,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51
412262,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34
412263,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09

In [8]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 755405 entries, 0 to 412263
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     755405 non-null  int64
 1   visitor_id    755405 non-null  object
 2   visit_id      755405 non-null  object
 3   process_step  755405 non-null  object
 4   date_time     755405 non-null  object
dtypes: int64(1), object(4)
memory usage: 34.6+ MB

In [9]:
dataset.isnull().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [10]:
dataset['process_step'].value_counts()

start      243945
step_1     163193
step_2     133062
step_3     112242
confirm    102963
Name: process_step, dtype: int64

In [11]:
clients_dataset=pd.read_csv('df_final_demo.txt')

In [12]:
clients_dataset

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0
...,...,...,...,...,...,...,...,...,...
70604,7993686,4.0,56.0,38.5,U,3.0,1411062.68,5.0,5.0
70605,8981690,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0
70606,333913,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0
70607,1573142,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0
70608,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0

In [13]:
clients_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70609 entries, 0 to 70608
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   client_id         70609 non-null  int64
 1   clnt_tenure_yr    70595 non-null  float64
 2   clnt_tenure_mnth  70595 non-null  float64
 3   clnt_age          70594 non-null  float64
 4   gendr             70595 non-null  object
 5   num_accts         70595 non-null  float64
 6   bal               70595 non-null  float64
 7   calls_6_mnth      70595 non-null  float64
 8   logons_6_mnth     70595 non-null  float64
dtypes: float64(7), int64(1), object(1)
memory usage: 4.8+ MB

In [14]:
clients_dataset=clients_dataset.rename(columns={
    'clnt_tenure_yr':'tenure_in_years',
    'clnt_tenure_mnth':'tenure_in_months',
    'clnt_age':'age',
    'gendr':'gender',
    'num_accts':'no_of_accounts',
    'bal':'balance',
    'calls_6_mnth':'calls_last_6_months',
    'logons_6_mnth':'logons_last_6_months'
})

In [15]:
clients_dataset.columns

Index(['client_id', 'tenure_in_years', 'tenure_in_months', 'age', 'gender',
       'no_of_accounts', 'balance', 'calls_last_6_months',
       'logons_last_6_months'],
      dtype='object')

In [16]:
clients_dataset.isnull().sum()

client_id                0
tenure_in_years         14
tenure_in_months        14
age                     15
gender                  14
no_of_accounts          14
balance                 14
calls_last_6_months     14
logons_last_6_months    14
dtype: int64

In [17]:
clients_dataset[clients_dataset.isnull().any(axis=1)]

,client_id,tenure_in_years,tenure_in_months,age,gender,no_of_accounts,balance,calls_last_6_months,logons_last_6_months
4164,7402828,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8316,355337,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8677,8412164,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9583,4666211,8.0,106.0,NaN,F,2.0,42550.55,4.0,7.0
13444,2222915,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18066,4876926,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25961,5277910,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
28432,7616759,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
35323,8191345,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
43518,1227228,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
46076,8611797,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
47189,5144725,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
49846,1037867,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
63701,1618749,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
66219,6021001,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [18]:
clients_dataset.dropna(thresh=2,inplace=True)

In [19]:
clients_dataset

,client_id,tenure_in_years,tenure_in_months,age,gender,no_of_accounts,balance,calls_last_6_months,logons_last_6_months
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0
...,...,...,...,...,...,...,...,...,...
70604,7993686,4.0,56.0,38.5,U,3.0,1411062.68,5.0,5.0
70605,8981690,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0
70606,333913,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0
70607,1573142,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0
70608,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0

In [20]:
clients_dataset.isnull().sum()

client_id               0
tenure_in_years         0
tenure_in_months        0
age                     1
gender                  0
no_of_accounts          0
balance                 0
calls_last_6_months     0
logons_last_6_months    0
dtype: int64

In [21]:
clients_dataset['age'].mean()

46.442240133722414

In [22]:
clients_dataset['age'].median()

47.0

In [23]:
clients_dataset['age'].fillna(clients_dataset['age'].mean(),inplace=True)

In [24]:
clients_dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70595 entries, 0 to 70608
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   client_id             70595 non-null  int64
 1   tenure_in_years       70595 non-null  float64
 2   tenure_in_months      70595 non-null  float64
 3   age                   70595 non-null  float64
 4   gender                70595 non-null  object
 5   no_of_accounts        70595 non-null  float64
 6   balance               70595 non-null  float64
 7   calls_last_6_months   70595 non-null  float64
 8   logons_last_6_months  70595 non-null  float64
dtypes: float64(7), int64(1), object(1)
memory usage: 5.4+ MB

In [25]:
clients_dataset['tenure_in_years'].value_counts()

6.0     7092
5.0     6955
7.0     4955
4.0     4687
15.0    4564
8.0     4045
14.0    3646
12.0    3631
13.0    3607
9.0     3357
11.0    2920
10.0    2775
16.0    2714
21.0    2257
20.0    1580
22.0    1492
17.0    1373
23.0    1279
18.0    1206
19.0    1153
24.0     846
26.0     660
27.0     632
28.0     507
25.0     484
3.0      449
29.0     309
30.0     303
33.0     206
32.0     191
34.0     175
31.0     166
35.0     102
2.0       81
36.0      36
37.0      35
38.0      33
48.0      16
39.0       9
40.0       9
55.0       9
50.0       8
47.0       6
43.0       6
42.0       6
46.0       5
51.0       5
49.0       4
44.0       3
52.0       2
54.0       1
41.0       1
45.0       1
62.0       1
Name: tenure_in_years, dtype: int64

In [26]:
clients_dataset['tenure_in_months'].value_counts()

58.0     1711
70.0     1404
59.0     1282
71.0     1020
82.0      974
         ...
655.0       1
564.0       1
526.0       1
532.0       1
480.0       1
Name: tenure_in_months, Length: 482, dtype: int64

In [27]:
clients_dataset['gender'].value_counts()

U    24122
M    23724
F    22746
X        3
Name: gender, dtype: int64

In [28]:
clients_dataset['gender']=clients_dataset['gender'].apply(lambda x: 'U' if x=='X' else x)

In [29]:
clients_dataset['gender'].value_counts()

U    24125
M    23724
F    22746
Name: gender, dtype: int64

In [30]:
clients_dataset_exp=pd.read_csv('df_final_experiment_clients.txt')

In [31]:
clients_dataset_exp

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
70604    2443347       NaN
70605    8788427       NaN
70606     266828       NaN
70607    1266421       NaN
70608    9895983       NaN

[70609 rows x 2 columns]

In [32]:
clients_dataset_exp.isnull().sum()

client_id        0
Variation    20109
dtype: int64

In [33]:
clients_dataset_exp['Variation'].value_counts()

Test       26968
Control    23532
Name: Variation, dtype: int64

In [34]:
clients_dataset_exp=clients_dataset_exp.dropna()

In [35]:
clients_dataset_exp

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
50495     393005   Control
50496    2908510   Control
50497    7230446      Test
50498    5230357      Test
50499    6334360      Test

[50500 rows x 2 columns]

In [36]:
clients_dataset_exp.describe()

          client_id
count  5.050000e+04
mean   5.006179e+06
std    2.877443e+06
min    5.550000e+02
25%    2.515646e+06
50%    5.025104e+06
75%    7.477933e+06
max    9.999832e+06

In [37]:
merged_dataset=pd.merge(clients_dataset,clients_dataset_exp,on='client_id')

In [38]:
merged_dataset

,client_id,tenure_in_years,tenure_in_months,age,gender,no_of_accounts,balance,calls_last_6_months,logons_last_6_months,Variation
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0,Test
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0,Control
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0,Test
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0,Test
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0,Control
...,...,...,...,...,...,...,...,...,...,...
50483,1780858,21.0,262.0,68.5,M,3.0,372100.59,6.0,9.0,Test
50484,6967120,21.0,260.0,68.5,M,3.0,4279873.38,6.0,9.0,Control
50485,5826160,20.0,249.0,56.5,F,2.0,44837.16,2.0,5.0,Test
50486,8739285,19.0,229.0,69.5,F,2.0,44994.24,1.0,4.0,Test
50487,7468138,18.0,222.0,61.0,F,3.0,209278.15,0.0,3.0,Test

In [39]:
merged_dataset.columns

Index(['client_id', 'tenure_in_years', 'tenure_in_months', 'age', 'gender',
       'no_of_accounts', 'balance', 'calls_last_6_months',
       'logons_last_6_months', 'Variation'],
      dtype='object')

In [40]:
merged_dataset.rename({'Variation':'variation'},inplace=True)

In [41]:
merged_dataset.columns

Index(['client_id', 'tenure_in_years', 'tenure_in_months', 'age', 'gender',
       'no_of_accounts', 'balance', 'calls_last_6_months',
       'logons_last_6_months', 'Variation'],
      dtype='object')

In [42]:
for column in ['tenure_in_years','tenure_in_months','age','no_of_accounts','balance','calls_last_6_months','logons_last_6_months']:
    merged_dataset[column].astype(int)
merged_dataset[['tenure_in_years','tenure_in_months','age','no_of_accounts','balance','calls_last_6_months','logons_last_6_months']].describe()

,tenure_in_years,tenure_in_months,age,no_of_accounts,balance,calls_last_6_months,logons_last_6_months
count,50488.000000,50488.000000,50488.000000,50488.000000,5.048800e+04,50488.000000,50488.000000
mean,12.031730,150.415485,47.319778,2.254575,1.495147e+05,3.093289,6.131873
std,6.860282,81.944830,15.518463,0.533671,3.020364e+05,2.187991,2.175423
min,2.000000,33.000000,17.000000,1.000000,2.378944e+04,0.000000,3.000000
25%,6.000000,82.000000,33.500000,2.000000,3.987841e+04,1.000000,4.000000
50%,11.000000,136.000000,48.000000,2.000000,6.573360e+04,3.000000,6.000000
75%,16.000000,192.000000,59.500000,2.000000,1.399565e+05,5.000000,8.000000
max,55.000000,669.000000,96.000000,7.000000,1.632004e+07,6.000000,9.000000

In [43]:
q1=merged_dataset[['tenure_in_years','tenure_in_months','age','no_of_accounts','balance','calls_last_6_months','logons_last_6_months']].quantile(0.25)
q3=merged_dataset[['tenure_in_years','tenure_in_months','age','no_of_accounts','balance','calls_last_6_months','logons_last_6_months']].quantile(0.75)
iqr=q3-q1

In [44]:
iqr

tenure_in_years             10.0000
tenure_in_months           110.0000
age                         26.0000
no_of_accounts               0.0000
balance                 100078.1375
calls_last_6_months          4.0000
logons_last_6_months         4.0000
dtype: float64